In [1]:
import pandas as pd
import numpy as np

In [46]:
s = pd.Series([1, 2, 'a'], index = list('456'))
print (s)
s.to_csv('try.csv')

4    1
5    2
6    a
dtype: object

In [5]:
a = np.random.randn(3,4)
a

array([[ 1.02206339,  0.51198104,  0.28974044, -0.14788833],
       [-0.15658239, -0.19917631, -0.13106158,  0.12723364],
       [-0.0342709 ,  0.85124534,  0.36830745,  0.12139884]])

In [9]:
a = {'row1': [1,2,3],'row2':[2,3,4]}
df = pd.DataFrame(data = a)
df

   row1  row2
0     1     2
1     2     3
2     3     4

In [2]:
df2 = pd.DataFrame(np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]])，
                   columns=['a', 'b', 'c'])
df2

SyntaxError: invalid character in identifier (<ipython-input-2-c3f96d00d1b6>, line 1)

In [14]:
list('123')

['1', '2', '3']

In [42]:
df3 = pd.DataFrame({'A': 1.,
                    'B': pd.Timestamp('20130102'),
                    'C': pd.Series(1,index=range(5,9), dtype='float32'),
                    'D': np.array([3] * 4, dtype='int32'),
                    'E': pd.Series(["test", "train", "test", "train"]),
                    'F': ['foo']}, index=range(5,9))
df3

     A          B    C  D    E    F
5  1.0 2013-01-02  1.0  3  NaN  foo
6  1.0 2013-01-02  1.0  3  NaN  foo
7  1.0 2013-01-02  1.0  3  NaN  foo
8  1.0 2013-01-02  1.0  3  NaN  foo

In [38]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E            object
F            object
dtype: object

In [43]:
df3.to_csv('dateframe.csv')

In [33]:
df4 = pd.DataFrame({'A': 1.,
                    'B': pd.Timestamp('20130102'),
                    'C': pd.Series(1,index = range(4),dtype='float32'),
                    'D': np.array([5,6,7,8]),
                    'E': pd.Categorical(["test", "train", "test", "train"]),
                    'F': 'foo'})

In [34]:
df4

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  5   test  foo
1  1.0 2013-01-02  1.0  6  train  foo
2  1.0 2013-01-02  1.0  7   test  foo
3  1.0 2013-01-02  1.0  8  train  foo

In [64]:
df4['B']

0   2013-01-02
1   2013-01-02
2   2013-01-02
3   2013-01-02
Name: B, dtype: datetime64[ns]

In [7]:
df4['G'] = pd.Series([9,8,5,3])
df4

     A          B    C  D      E    F  G
0  1.0 2013-01-02  1.0  3   test  foo  9
1  1.0 2013-01-02  1.0  3  train  foo  8
2  1.0 2013-01-02  1.0  3   test  foo  5
3  1.0 2013-01-02  1.0  3  train  foo  3

In [8]:
df4

     A          B    C  D      E    F  G
0  1.0 2013-01-02  1.0  3   test  foo  9
1  1.0 2013-01-02  1.0  3  train  foo  8
2  1.0 2013-01-02  1.0  3   test  foo  5
3  1.0 2013-01-02  1.0  3  train  foo  3

In [10]:
df4.sort_values('G')

     A          B    C  D      E    F  G
3  1.0 2013-01-02  1.0  3  train  foo  3
2  1.0 2013-01-02  1.0  3   test  foo  5
1  1.0 2013-01-02  1.0  3  train  foo  8
0  1.0 2013-01-02  1.0  3   test  foo  9

In [35]:
df4

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  5   test  foo
1  1.0 2013-01-02  1.0  6  train  foo
2  1.0 2013-01-02  1.0  7   test  foo
3  1.0 2013-01-02  1.0  8  train  foo

In [38]:
df4.iloc[0:2,4:6]

       E    F
0   test  foo
1  train  foo

In [42]:
df5 = pd.DataFrame(np.random.randn(4,5),columns = ['a', 'b','c','d','e'])
df5

          a         b         c         d         e
0  0.116526  0.579807 -1.378468 -1.843615 -0.321637
1 -0.061100  1.304236 -0.025663  0.787866  2.432283
2  1.294462 -1.456094 -0.878053 -1.357962  0.016475
3 -0.383107  1.247216  1.488682  1.777233  0.315590

In [49]:
piece = [df5[:2],df5[2:3]]
d = pd.concat(piece)
d

          a         b         c         d         e
0  0.116526  0.579807 -1.378468 -1.843615 -0.321637
1 -0.061100  1.304236 -0.025663  0.787866  2.432283
2  1.294462 -1.456094 -0.878053 -1.357962  0.016475

In [59]:
a = pd.DataFrame({'s': ['a','a'], 'w': [ 'bb','bc']})
b = pd.DataFrame({'s': ['a','a'], 'h': [ 'gb','gc']})
pd.merge(a,b, on='s')

   s   w   h
0  a  bb  gb
1  a  bb  gc
2  a  bc  gb
3  a  bc  gc